Revit 2027 API
Category.GetBuiltInCategoryDisciplines Method
 Get the ForgeTypeId identifier for each discipline for the given built-in category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<ForgeTypeId> GetBuiltInCategoryDisciplines(
	BuiltInCategory categoryId
)
Public Shared Function GetBuiltInCategoryDisciplines (
	categoryId As BuiltInCategory
) As IList(Of ForgeTypeId)
public:
static IList<ForgeTypeId^>^ GetBuiltInCategoryDisciplines(
	BuiltInCategory categoryId
)
static member GetBuiltInCategoryDisciplines :
        categoryId : BuiltInCategory -> IList<ForgeTypeId>
Parameters
categoryId BuiltInCategory
 The built-in category.
Return Value
IList<ForgeTypeId>
 The identifiers of disciplines for the given built-in category.
Exceptions
Exception | Condition
ArgumentException |  categoryId is not a valid built-in category. See Category.IsBuiltInCategoryValid(BuiltInCategory).
Remarks
 The returned list contains one or more identifiers of disciplines that can be compared with [!:Autodesk::Revit::DB::DisciplineTypeId]. The given BuiltInCategory value must be valid according to Category.IsBuiltInCategoryValid(BuiltInCategory).
See Also
Reference
Category Class
Autodesk.Revit.DB Namespace